**`teams/nomis-data-hub/rhel_7_9_app`** terragrunt plan on `pull_request` event [#200](${url})

```
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Reading...
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Reading...
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Reading...
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Read complete after 2s
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Reading...
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Read complete after 1s
module.imagebuilder.data.aws_caller_identity.current: Reading...
module.imagebuilder.data.aws_imagebuilder_component.this["update-linux"]: Reading...
module.imagebuilder.data.aws_caller_identity.current: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Reading...
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.aws_imagebuilder_component.this["update-linux"]: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_image_recipe.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_distribution_configuration.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_image_pipeline.this: Refreshing state... [id=<REDACTED>]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.imagebuilder.aws_imagebuilder_distribution_configuration.this will be updated in-place
  ~ resource "aws_imagebuilder_distribution_configuration" "this" {
        id           = "arn:aws:imagebuilder:eu-west-2:374269020027:distribution-configuration/nomis-data-hub-rhel-7-9-app"
        name         = "nomis_data_hub_rhel_7_9_app"
      ~ tags         = {
            "application"                  = "NOMIS-DATA-HUB"
          ~ "branch"                       = "DSOS/ndh-app-fix" -> "main"
            "business-unit"                = "HMPPS"
            "image-pipeline"               = "nomis_data_hub_rhel_7_9_app"
          ~ "image-recipe"                 = "nomis_data_hub_rhel_7_9_app/0.0.5" -> "nomis_data_hub_rhel_7_9_app/0.0.4"
          ~ "infrastructure-configuration" = "nomis_data_hub_rhel_7_9_app/0.0.5" -> "nomis_data_hub_rhel_7_9_app/0.0.4"
          ~ "is-production"                = "false" -> "true"
            "os-version"                   = "rhel 7.9"
            "owner"                        = "DSO: digital-studio-operations-team@digital.justice.gov.uk"
          ~ "release-or-patch"             = "test" -> "release"
            "source-code"                  = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/nomis-data-hub"
            "update-linux-version"         = "1.0.2"
        }
      ~ tags_all     = {
          ~ "branch"                       = "DSOS/ndh-app-fix" -> "main"
          ~ "image-recipe"                 = "nomis_data_hub_rhel_7_9_app/0.0.5" -> "nomis_data_hub_rhel_7_9_app/0.0.4"
          ~ "infrastructure-configuration" = "nomis_data_hub_rhel_7_9_app/0.0.5" -> "nomis_data_hub_rhel_7_9_app/0.0.4"
          ~ "is-production"                = "false" -> "true"
          ~ "release-or-patch"             = "test" -> "release"
            # (7 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

      - distribution {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + distribution {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.imagebuilder.aws_imagebuilder_image_pipeline.this must be replaced
-/+ resource "aws_imagebuilder_image_pipeline" "this" {
      ~ arn                              = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/nomis-data-hub-rhel-7-9-app" -> (known after apply)
      ~ date_created                     = "2024-03-25T10:32:39.132Z" -> (known after apply)
      ~ date_last_run                    = "2024-04-02T00:00:07.562Z" -> (known after apply)
      ~ date_next_run                    = "2024-05-02T00:00:00.000Z" -> (known after apply)
      ~ date_updated                     = "2024-03-25T10:32:39.132Z" -> (known after apply)
      ~ id                               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/nomis-data-hub-rhel-7-9-app" -> (known after apply)
      ~ image_recipe_arn                 = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/nomis-data-hub-rhel-7-9-app/0.0.5" # forces replacement -> (known after apply) # forces replacement
      ~ infrastructure_configuration_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/nomis-data-hub-rhel-7-9-app-0-0-5" -> (known after apply)
        name                             = "nomis_data_hub_rhel_7_9_app"
      ~ platform                         = "Linux" -> (known after apply)
      ~ tags                             = {
            "application"                  = "NOMIS-DATA-HUB"
          ~ "branch"                       = "DSOS/ndh-app-fix" -> "main"
            "business-unit"                = "HMPPS"
            "image-pipeline"               = "nomis_data_hub_rhel_7_9_app"
          ~ "image-recipe"                 = "nomis_data_hub_rhel_7_9_app/0.0.5" -> "nomis_data_hub_rhel_7_9_app/0.0.4"
          ~ "infrastructure-configuration" = "nomis_data_hub_rhel_7_9_app/0.0.5" -> "nomis_data_hub_rhel_7_9_app/0.0.4"
          ~ "is-production"                = "false" -> "true"
            "os-version"                   = "rhel 7.9"
            "owner"                        = "DSO: digital-studio-operations-team@digital.justice.gov.uk"
          ~ "release-or-patch"             = "test" -> "release"
            "source-code"                  = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/nomis-data-hub"
            "update-linux-version"         = "1.0.2"
        }
      ~ tags_all                         = {
          ~ "branch"                       = "DSOS/ndh-app-fix" -> "main"
          ~ "image-recipe"                 = "nomis_data_hub_rhel_7_9_app/0.0.5" -> "nomis_data_hub_rhel_7_9_app/0.0.4"
          ~ "infrastructure-configuration" = "nomis_data_hub_rhel_7_9_app/0.0.5" -> "nomis_data_hub_rhel_7_9_app/0.0.4"
          ~ "is-production"                = "false" -> "true"
          ~ "release-or-patch"             = "test" -> "release"
            # (7 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

      ~ schedule {
          + timezone                           = (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.imagebuilder.aws_imagebuilder_image_recipe.this must be replaced
+/- resource "aws_imagebuilder_image_recipe" "this" {
      ~ arn              = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/nomis-data-hub-rhel-7-9-app/0.0.5" -> (known after apply)
      ~ date_created     = "2024-03-25T10:32:38.027Z" -> (known after apply)
      ~ id               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/nomis-data-hub-rhel-7-9-app/0.0.5" -> (known after apply)
        name             = "nomis_data_hub_rhel_7_9_app"
      ~ owner            = "374269020027" -> (known after apply)
      ~ platform         = "Linux" -> (known after apply)
      ~ tags             = {
            "application"                  = "NOMIS-DATA-HUB"
          ~ "branch"                       = "DSOS/ndh-app-fix" -> "main"
            "business-unit"                = "HMPPS"
            "image-pipeline"               = "nomis_data_hub_rhel_7_9_app"
          ~ "image-recipe"                 = "nomis_data_hub_rhel_7_9_app/0.0.5" -> "nomis_data_hub_rhel_7_9_app/0.0.4"
          ~ "infrastructure-configuration" = "nomis_data_hub_rhel_7_9_app/0.0.5" -> "nomis_data_hub_rhel_7_9_app/0.0.4"
          ~ "is-production"                = "false" -> "true"
            "os-version"                   = "rhel 7.9"
            "owner"                        = "DSO: digital-studio-operations-team@digital.justice.gov.uk"
          ~ "release-or-patch"             = "test" -> "release"
            "source-code"                  = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/nomis-data-hub"
            "update-linux-version"         = "1.0.2"
        }
      ~ tags_all         = {
          ~ "branch"                       = "DSOS/ndh-app-fix" -> "main"
          ~ "image-recipe"                 = "nomis_data_hub_rhel_7_9_app/0.0.5" -> "nomis_data_hub_rhel_7_9_app/0.0.4"
          ~ "infrastructure-configuration" = "nomis_data_hub_rhel_7_9_app/0.0.5" -> "nomis_data_hub_rhel_7_9_app/0.0.4"
          ~ "is-production"                = "false" -> "true"
          ~ "release-or-patch"             = "test" -> "release"
            # (7 unchanged elements hidden)
        }
      + user_data_base64 = (known after apply)
      ~ version          = "0.0.5" -> "0.0.4" # forces replacement
        # (2 unchanged attributes hidden)

      ~ component {
            # (1 unchanged attribute hidden)

          - parameter { # forces replacement
              - name  = "Branch" -> null
              - value = "main" -> null
            }
          + parameter { # forces replacement
              + name  = "Branch"
              + value = "feature/DSOS-1506/test_ami"
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this must be replaced
-/+ resource "aws_imagebuilder_infrastructure_configuration" "this" {
      ~ arn                           = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/nomis-data-hub-rhel-7-9-app-0-0-5" -> (known after apply)
      ~ date_created                  = "2024-03-25T10:32:38.199Z" -> (known after apply)
      + date_updated                  = (known after apply)
      ~ id                            = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/nomis-data-hub-rhel-7-9-app-0-0-5" -> (known after apply)
      ~ name                          = "nomis_data_hub_rhel_7_9_app_0_0_5" -> "nomis_data_hub_rhel_7_9_app_0_0_4" # forces replacement
      ~ resource_tags                 = {
          ~ "branch"                       = "DSOS/ndh-app-fix" -> "main"
          ~ "image-recipe"                 = "nomis_data_hub_rhel_7_9_app/0.0.5" -> "nomis_data_hub_rhel_7_9_app/0.0.4"
          ~ "infrastructure-configuration" = "nomis_data_hub_rhel_7_9_app/0.0.5" -> "nomis_data_hub_rhel_7_9_app/0.0.4"
          ~ "is-production"                = "false" -> "true"
          ~ "release-or-patch"             = "test" -> "release"
            # (7 unchanged elements hidden)
        }
      ~ tags                          = {
            "application"                  = "NOMIS-DATA-HUB"
          ~ "branch"                       = "DSOS/ndh-app-fix" -> "main"
            "business-unit"                = "HMPPS"
            "image-pipeline"               = "nomis_data_hub_rhel_7_9_app"
          ~ "image-recipe"                 = "nomis_data_hub_rhel_7_9_app/0.0.5" -> "nomis_data_hub_rhel_7_9_app/0.0.4"
          ~ "infrastructure-configuration" = "nomis_data_hub_rhel_7_9_app/0.0.5" -> "nomis_data_hub_rhel_7_9_app/0.0.4"
          ~ "is-production"                = "false" -> "true"
            "os-version"                   = "rhel 7.9"
            "owner"                        = "DSO: digital-studio-operations-team@digital.justice.gov.uk"
          ~ "release-or-patch"             = "test" -> "release"
            "source-code"                  = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/nomis-data-hub"
            "update-linux-version"         = "1.0.2"
        }
      ~ tags_all                      = {
          ~ "branch"                       = "DSOS/ndh-app-fix" -> "main"
          ~ "image-recipe"                 = "nomis_data_hub_rhel_7_9_app/0.0.5" -> "nomis_data_hub_rhel_7_9_app/0.0.4"
          ~ "infrastructure-configuration" = "nomis_data_hub_rhel_7_9_app/0.0.5" -> "nomis_data_hub_rhel_7_9_app/0.0.4"
          ~ "is-production"                = "false" -> "true"
          ~ "release-or-patch"             = "test" -> "release"
            # (7 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 3 to add, 1 to change, 3 to destroy.

```
